app/controllers/authentication_controller.rb

  def login
    username_or_email = params[:user][:username]
    user = verify_user(username_or_email)

    if user
      update_authentication_token(user, params[:user][:remember_me])
      user.last_signed_in_on=DateTime.now
      user.save
---
UPDATE `users` SET `last_signed_in_on` = '2014-11-01 09:08:18' WHERE `users`.`id` = 1

  def signed_out
    # clear the authentication toke when the user manually signs out
    user = User.find_by_id(session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def register
    @user = User.new(params[:user])

    # Don't use !verify_recaptcha, as this terminates the connection with the server.
    # It almost seems as if the verify_recaptcha is being called twice with we use "not".
    if verify_recaptcha
      if @user.valid?
        update_authentication_token(@user, nil)
        @user.signed_up_on = DateTime.now
        @user.last_signed_in_on = @user.signed_up_on
        @user.save
---
INSERT INTO `users` (`authentication_token`, `email`, `is_admin`, `last_signed_in_on`, `password_expires_after`, `password_hash`, `password_reset_token`, `password_salt`, `signed_up_on`, `username`) VALUES (NULL, 'gore.san@gmail.com', NULL, '2014-11-01 09:07:42', NULL, '$2a$10$uc1ShPHEBqo1f0qDwNv4pevSmfJ8uwXTtJRNSmTVXpp3WsPRHe63G', NULL, '$2a$10$uc1ShPHEBqo1f0qDwNv4pe', '2014-11-01 09:07:42', 'gore.san')

  def set_account_info
    old_user = current_user

    # verify the current password by creating a new user record.
    @user = User.authenticate_by_username(old_user.username, params[:user][:password])

    # verify
    if @user.nil?
      @user = old_user
      @user.errors[:password] = "Password is incorrect."
      render :action => "account_settings"
    else
      # update the user with any new username and email
      @user.update(params[:user])
      # Set the old email and username, which is validated only if it has changed.
      @user.previous_email = old_user.email
      @user.previous_username = old_user.username

      if @user.valid?
        # If there is a new_password value, then we need to update the password.
        @user.password = @user.new_password unless @user.new_password.nil? || @user.new_password.empty?
---
UPDATE `users` SET `password_reset_token` = 'lLTlllgRP98PY2yMGlt3Ag', `password_expires_after` = '2014-11-02 09:09:01' WHERE `users`.`id` = 1
SELECT 1 AS one FROM `users` WHERE (`users`.`email` = BINARY 'gore.san@gmail.com' AND `users`.`id` != 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'gore.san@gmail.com' LIMIT 1