app/controllers/classtables_controller.rb

  def index
    @classtables = Classtable.all
---
SELECT `classtables`.* FROM `classtables`