app/controllers/classtables_controller.rb

SELECT `schools`.* FROM `schools` WHERE (school_name LIKE '%1%' OR state LIKE '%1%' OR district LIKE '%1%' OR address LIKE '%1%')
SELECT `classtables`.* FROM `classtables` WHERE `classtables`.`id` = 1 LIMIT 1
---
  def index
#    @classtable = Classtable.all
	@school2 = School.find(params[:id])
	 @classtables = Classtable.find(:all,:conditions => { :school_id => @school2.id })

SELECT `classtables`.* FROM `classtables` WHERE `classtables`.`id` = 1 LIMIT 1
---
  def show
    @classtable = Classtable.find(params[:id])

INSERT INTO `classtables` (`class_no`, `created_at`, `gen_seats`, `obc_seats`, `other_seats`, `sc_seats`, `school_id`, `st_seats`, `updated_at`) VALUES (1, '2014-11-11 18:03:57', 1, 1, 1, 1, 1, 1, '2014-11-11 18:03:57')
---
  def create
    @classtable = Classtable.new(params[:classtable])

    respond_to do |format|
      if @classtable.save