app/controllers/home_controller.rb

def index
  @schools = School.search(params[:search])
---
SELECT `schools`.* FROM `schools`