app/controllers/schools_controller.rb

  def index
    @schools = School.search(params[:search])
	if current_user
		@schools = School.find(:all,:conditions => { :user_id=> current_user.id })
---
SELECT `schools`.* FROM `schools`
SELECT `schools`.* FROM `schools` WHERE `schools`.`user_id` = 1

  def show
    @school = School.find(params[:id])
---
SELECT `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1

  def create
    @school = School.new(params[:school])
    @school.user_id=current_user.id
    #@school.user_id=12
    respond_to do |format|
      if @school.save
---
INSERT INTO `schools` (`address`, `created_at`, `district`, `email_id`, `fax`, `latitude`, `longitude`, `phone`, `phone2`, `pin`, `reg_id`, `school_name`, `state`, `updated_at`, `user_id`) VALUES ('a', '2014-11-11 16:34:08', 'a', 'a', 'a', NULL, NULL, '1234567890', '12345678901', 123456, 'a3', 'a', 'a', '2014-11-11 16:34:08', 1)